[
  {
    "title": "DALLE Red-Teaming",
    "image": "dalle-walle-11.png",
    "description": [
      "Part of the team of AI Researchers to probe ('red team') OpenAI's DALLE-2 prior to its public release to detect potential harms, biases, and disinformation."
    ],
    "codelink": "https://github.com/openai/dalle-2-preview/blob/main/system-card.md",
    "tags": ["AI Art"],
    "instagramlink": "https://www.instagram.com/myworldin.ai/"
  },
  {
    "title": "Scaling Radio Analysis with Data Science for Infodemic Monitoring",
    "image": "dalle-radio-3.png",
    "description": [
      "Evaluated and analyzed COVID-19 vaccine discourse on public radio transcriptions for public health monitoring. Master's Thesis with the Oxford Internet Institute and United Nations Global Pulse."
    ],
    "articlelink": "https://www.unglobalpulse.org/2022/01/scaling-radio-analysis-with-data-science-for-infodemic-monitoring/",
    "tags": ["NLP"],
    "codelink": "https://github.com/yenniejun/thesis-radio"
  },
  {
    "title": "Bias Out-of-the-Box: An Empirical Analysis of Intersectional Occupational Biases in Popular Generative Language Models", 
    "image": "midjourney-computer-2.png",
    "description": [
      "Probed GPT-2 with prefix templates related to gender and occupation to evaluate biases in its predictions, which were compared wtih ground-truth US labor data."
    ],
    "paperlink":"https://proceedings.neurips.cc/paper/2021/hash/1531beb762df4029513ebf9295e0d34f-Abstract.html",
    "codelink": "https://github.com/oxai/intersectional_gpt2",
    "tags": ["NLP", "bias in AI"]
  },
  {
    "title": "Memes in the Wild: Assessing the Generalizability of the Hateful Memes Challenge Dataset", 
    "image": "midjourney-memes-3.png",
    "description": [
      "Evaluated Facebook's Hateful Meme Challenge by comparing Facebook's carefully synthesized dataset with a collection of 'memes in the wild' gathered from Pinterest."
    ],
    "paperlink":"https://aclanthology.org/2021.woah-1.4/",
    "tags": ["NLP", "multimodal"]
    },
    
    {
      "title": "Covid Texting Service", 
      "image": "dalle-phone-1.png",
      "description": [
        "Created texting service for answering questions related to the pandemic and providing COVID-19 statistics to those without access to Internet. This is a working project with Silicon Harlem in NYC to get the service in the hands of people in need."
      ],
      "announcement": "Demo: Text 1NYC to 313131",
      "codelink":"https://github.com/yenniejun/covid-texting-service",
      "tags": ["twilio", "full-stack development"]
    },
    {
      "title": "Data Surveillance and Biocitizenship in the COVID-19 Pandemic: Digital Contact-tracing in South Korea, Hong Kong, Singapore, and Taiwan", 
      "image": "midjourney-covid-1.png",
      "description": [
        "Analyzed the privacy implications of digital contact tracing during the early days of the COVID-19 pandemic through topic modeling and semantic network analysis of news media from 6 countries and 3 languages."
      ],
      "codelink":"https://github.com/yenniejun/covid-news-analysis",
      "tags": ["topic modeling", "text cleaning", "networks"]
    },
    {
      "title": "Big Data as Historical Archive: The Challenges of Preserving Today’s Digital Artifacts", 
      "image": "midjourney-datacenter-4.png",
      "description": [
        "Examined the greatest challenges for long-term preservation of big data, challenges which differ from the preservation of mostly static, smaller-scale digital material which had concerned archivists in the past. With Seoul National University Big Data Studies Lab."
      ],
      "tags": ["big data studies", "digital history", "digital humanities"]
    },

    {
      "title": "Joseon Munkwa Project", 
      "image": "projects-sillok.jpg",
      "description": [
        "Conducted named-entity recognition and disambiguation on historical figures from Korean Joseon-Dynasty civil service roster data. With Seoul National University Big Data Studies Lab."
      ],
      "codelink": "https://github.com/yenniejun/JoseonMunkwa",
      "tags": ["digital history", "digital humanities", "NER", "disambiguation"]
    },
    {
      "title": "Virtual Coffeeshop", 
      "image": "dalle-coffee-2.PNG",
      "description": [
        "Created virtual coffeeshop experience for those of us stuck at home during stay-at-home and seeking the vibe and comradeship of a cafe."
      ],
      "demolink": "https://virtualcoffeeshop.herokuapp.com/",
      "codelink": "https://github.com/yenniejun/internetcafe",
      "tags": ["full-stack development", "react"]
    },
    {
      "title": "Music Factorization", 
      "image": "midjourney-music-1.png",
      "description": [
        "Factorized a scale into parts that can be understood using combinations of 'symmetric' scales. An exercise in breaking down all scales into a combination of whole tone scales."
      ],
      "codelink": "https://github.com/yenniejun/music-factorization",
      "tags": ["Python", "music theory"]
    }
  ]


  