[
      {
        "title": "Tuning In: COVID-19 Vaccine Discourse on Public Radio in South Africa and Nigeria",
        "image": "projects-thesis.png",
        "description": [
          "Evaluated COVID-19 vaccine discourse on public radio streams from South Africa and Nigeria using temporal word embeddings. Master's Thesis with the Oxford Internet Institute and UNGP."
        ],
        "codelink": "https://github.com/yenniejun/thesis-radio",
        "tags": ["NLP"]
      },
      {
      "title": "Memes in the Wild: Assessing the Generalizability of the Hateful Memes Challenge Dataset", 
      "image": "projects-memes.png",
      "description": [
        "Evaluated Facebook's Hateful Meme Challenge by comparing Facebook's carefully synthesized dataset with a collection of 'memes in the wild' gathered from Pinterest."
      ],
      "paperlink":"https://arxiv.org/abs/2107.04313",
      "tags": ["NLP", "multimodal"]
    },
    {
      "title": "Bias Out-of-the-Box: An Empirical Analysis of Intersectional Occupational Biases in Popular Generative Language Models", 
      "image": "projects-gpt2.jpg",
      "description": [
        "Probed GPT-2 with prefix templates related to gender and occupation to evaluate biases in its predictions, which were compared wtih ground-truth US labor data."
      ],
      "paperlink":"https://proceedings.neurips.cc/paper/2021/hash/1531beb762df4029513ebf9295e0d34f-Abstract.html",
      "codelink": "https://github.com/oxai/intersectional_gpt2",
      "tags": ["NLP", "bias in AI"]
    },
    {
      "title": "The Effect of Government Type on COVID-19 Restrictions", 
      "image": "projects-covidgovernment.png",
      "description": [
        "Examined the relationship between government response to COVID-19 and country’s level of democracy and ask whether the regime type of a government has an impact on that government’s response."
      ],
      "articlelink":"https://towardsdatascience.com/did-government-type-have-an-effect-on-restrictive-covid-19-measures-68fa31124b8d",
      "codelink": "https://github.com/yenniejun/covid_government_type",
      "tags": ["data wrangling", "text cleaning"]
    },
    {
      "title": "Covid Texting Service", 
      "image": "projects-covidtexting.png",
      "description": [
        "Created texting service for answering questions related to the pandemic and providing COVID-19 statistics to those without access to Internet. This is a working project with Silicon Harlem in NYC to get the service in the hands of people in need."
      ],
      "announcement": "Demo: Text 1NYC to 313131",
      "codelink":"https://github.com/yenniejun/covid-texting-service",
      "tags": ["twilio", "full-stack development"]
    },
    {
      "title": "Data Surveillance and Biocitizenship in the COVID-19 Pandemic: Digital Contact-tracing in South Korea, Hong Kong, Singapore, and Taiwan", 
      "image": "projects-contacttracing.png",
      "description": [
        "Analyzed the privacy implications of digital contact tracing in East Asian countries during the COVID-19 pandemic through topic modeling and semantic network analysis of news media. Analysis conducted across 6 countries and 3 languages (Korean, English, Chinese)."
      ],
      "codelink":"https://github.com/yenniejun/covid-news-analysis",
      "tags": ["topic modeling", "text cleaning", "networks"]
    },
    {
      "title": "Big Data as Historical Archive: The Challenges of Preserving Today’s Digital Artifacts", 
      "image": "archives_of_the_future.jpg",
      "description": [
        "Examined the greatest challenges for long-term preservation of big data, challenges which differ from the preservation of mostly static, smaller-scale digital material which had concerned archivists in the past."
      ],
      "tags": ["big data studies", "digital history", "digital humanities"]
    },

    {
      "title": "Joseon Munkwa Project", 
      "image": "projects-sillok.jpg",
      "description": [
        "Conducted named-entity recognition and disambiguation on historical figures from Korean Joseon-Dynasty civil service roster data."
      ],
      "codelink": "https://github.com/yenniejun/JoseonMunkwa",
      "tags": ["digital history", "digital humanities", "NER", "disambiguation"]
    },
    {
      "title": "Virtual Coffeeshop", 
      "image": "projects-cafebackground.png",
      "description": [
        "Created virtual coffeeshop experience for those of us stuck at home during stay-at-home and seeking the vibe and comradeship of a cafe."
      ],
      "demolink": "https://virtualcoffeeshop.herokuapp.com/",
      "codelink": "https://github.com/yenniejun/internetcafe",
      "tags": ["full-stack development", "react"]
    },
    {
      "title": "Music Factorization", 
      "image": "projects-music.png",
      "description": [
        "Factorized a scale into parts that can be understood using combinations of 'symmetric' scales. An exercise in breaking down all scales into a combination of whole tone scales."
      ],
      "codelink": "https://github.com/yenniejun/music-factorization",
      "tags": ["Python", "music theory"]
    }
  ]


  